app/views/users/show.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 1
---

          <%  current_user.reviews.each do |review| %>