app/controllers/products_controller.rb

  def index
    # productsテーブルから最新順に作品を２０件取得する
    # @products = []
    @products = Product.order('id ASC').limit(20)
---
SELECT  `products`.* FROM `products` ORDER BY id ASC LIMIT 20

  def show
    # productsテーブルから該当するidの作品情報を取得し@productの変数へ代入する処理を書いて下さい
    # @product = Product.new # 問題3ではこのコードは消して新しくコードを書いてください
    @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1