app/views/products/index.html.erb

                        </span> -->
                      <% if product.reviews.present? %>
                      <span class="rating-star">
                        <!-- <i class="star-actived rate-<%#= product.reviews.average(:rate).round %>0"></i> -->
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1
SELECT AVG(`reviews`.`rate`) FROM `reviews` WHERE `reviews`.`product_id` = 1